Tekla Open API Reference for Tekla Structures 2025
MaterialSelectionForm Properties
The MaterialSelectionForm type exposes the following members.
Properties
Name | Description
SelectedMaterial
 The selected material in the control.
Top
See Also
Reference
MaterialSelectionForm Class
Tekla.Structures.Dialog.UIControls Namespace